-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:8889
-- Время создания: Май 18 2025 г., 21:37
-- Версия сервера: 5.7.39
-- Версия PHP: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `organshop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `slug`, `created_at`, `updated_at`) VALUES
(1, 'молочные продукты', 'molochnye-produkty', NULL, NULL),
(2, 'яйцо', 'yace', NULL, NULL),
(3, 'мясо', 'miaso', NULL, '2025-05-04 19:27:26'),
(4, 'рыба', 'ryba', NULL, NULL),
(5, 'фрукты и овощи', 'frukty-i-ovoshchi', NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `contacts`
--

CREATE TABLE `contacts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `comment` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `contacts`
--

INSERT INTO `contacts` (`id`, `name`, `email`, `phone`, `comment`, `created_at`, `updated_at`) VALUES
(1, 'User2', 'user2@mail.ru', '123456789', 'все супер', '2025-04-14 18:57:53', '2025-04-14 18:57:53');

-- --------------------------------------------------------

--
-- Структура таблицы `coupons`
--

CREATE TABLE `coupons` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` enum('fixed','percent') COLLATE utf8mb4_unicode_ci NOT NULL,
  `value` decimal(8,2) NOT NULL,
  `cart_value` decimal(8,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `expiry_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `coupons`
--

INSERT INTO `coupons` (`id`, `code`, `type`, `value`, `cart_value`, `created_at`, `updated_at`, `expiry_date`) VALUES
(2, 'OFF100', 'fixed', '100.00', '1000.00', '2025-04-09 08:11:59', '2025-04-09 13:33:49', '2025-04-07 15:19:15'),
(3, 'OFF20P', 'percent', '20.00', '1200.00', '2025-04-09 08:12:36', '2025-04-09 08:12:36', '2025-04-09 15:19:15'),
(4, 'OFF30P', 'percent', '30.00', '1300.00', '2025-04-09 13:06:08', '2025-04-09 13:12:33', '2025-05-01 16:05:50');

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `home_categories`
--

CREATE TABLE `home_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sel_categories` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `no_of_products` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `home_categories`
--

INSERT INTO `home_categories` (`id`, `sel_categories`, `no_of_products`, `created_at`, `updated_at`) VALUES
(1, '1,2,3', 8, '2025-03-29 10:38:03', '2025-03-29 10:28:17');

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(49, '2014_10_12_000000_create_users_table', 1),
(50, '2014_10_12_100000_create_password_resets_table', 1),
(51, '2014_10_12_200000_add_two_factor_columns_to_users_table', 1),
(52, '2019_08_19_000000_create_failed_jobs_table', 1),
(53, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(54, '2024_10_17_235928_create_sessions_table', 1),
(55, '2024_10_18_224731_create_categories_table', 1),
(56, '2024_10_18_232257_create_products_table', 1),
(57, '2024_11_10_233550_create_shoppingcart_table', 2),
(58, '2025_03_29_100029_create_home_categories_table', 3),
(59, '2025_04_03_070850_create_sales_table', 4),
(60, '2025_04_05_141544_create_coupons_table', 5),
(61, '2025_04_09_150907_add_expiry_date_to_coupons_table', 6),
(62, '2025_04_09_171245_create_orders_table', 7),
(63, '2025_04_09_171341_create_order_items_table', 7),
(64, '2025_04_09_171442_create_shippings_table', 7),
(65, '2025_04_09_171539_create_transactions_table', 7),
(66, '2025_04_12_120246_add_delivered_canceled_date_to_orders_table', 8),
(67, '2025_04_12_205304_create_reviews_table', 9),
(68, '2025_04_12_210119_add_rstatus_to_order_items_table', 9),
(69, '2025_04_14_194708_create_contacts_table', 10),
(70, '2025_04_14_221045_create_settings_table', 11),
(71, '2025_04_17_105146_create_subcategories_table', 12),
(72, '2025_04_19_150726_add_subcategory_id_to_products_table', 13),
(73, '2025_04_25_140723_create_profiles_table', 14);

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `subtotal` decimal(8,2) NOT NULL,
  `discount` decimal(8,2) NOT NULL DEFAULT '0.00',
  `tax` decimal(8,2) NOT NULL,
  `total` decimal(8,2) NOT NULL,
  `firstname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `lastname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `line1` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `line2` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `province` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `zipcode` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` enum('ordered','delivered','canceled') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'ordered',
  `is_shipping_different` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `delivered_date` date DEFAULT NULL,
  `canceled_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `subtotal`, `discount`, `tax`, `total`, `firstname`, `lastname`, `mobile`, `email`, `line1`, `line2`, `city`, `province`, `country`, `zipcode`, `status`, `is_shipping_different`, `created_at`, `updated_at`, `delivered_date`, `canceled_date`) VALUES
(1, 5, '199.00', '0.00', '41.79', '240.79', 'Username', 'Usersurname', '123456789', 'user@mail.ru', 'testul', 'testdom, testkv', 'testgorod', 'testray', 'testreg', '123456', 'ordered', 1, '2025-04-10 10:56:59', '2025-04-10 10:56:59', NULL, NULL),
(2, 5, '199.00', '0.00', '41.79', '240.79', 'Username', 'Usersurname', '123456789', 'user@mail.ru', 'testul', 'testdom, testkv', 'testgorod', 'testray', 'testreg', '123456', 'ordered', 1, '2025-04-10 10:57:25', '2025-04-10 10:57:25', NULL, NULL),
(3, 5, '199.00', '0.00', '41.79', '240.79', 'Username', 'Usersurname', '123456789', 'user@mail.ru', 'testul', 'testdom, testkv', 'testgorod', 'testray', 'testreg', '123456', 'ordered', 1, '2025-04-10 10:57:51', '2025-04-10 10:57:51', NULL, NULL),
(4, 5, '199.00', '0.00', '41.79', '240.79', 'Username', 'Usersurname', '123456789', 'user@mail.ru', 'testul', 'testdom, testkv', 'testgorod', 'testray', 'testreg', '123456', 'ordered', 1, '2025-04-10 10:58:15', '2025-04-10 10:58:15', NULL, NULL),
(5, 6, '703.00', '0.00', '147.63', '850.63', 'Иван', 'Иванов', '123456789', 'Ivan@mail.ru', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Левобережный', 'Москва', '123456', 'delivered', 0, '2025-04-11 04:28:17', '2025-04-12 14:09:56', '2025-04-12', NULL),
(6, 6, '199.00', '0.00', '41.79', '240.79', 'Вася', 'Пупкин', '12345678', 'vasya@mail.ru', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Левобережный', 'Москва', '123456', 'canceled', 1, '2025-04-12 16:40:28', '2025-04-12 16:41:17', NULL, '2025-04-12'),
(7, 8, '858.00', '0.00', '180.18', '1038.18', 'Мери', 'Варданян', '12345678', 'mary.vardanian.1@gmail.com', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Ленина', 'Москва', '123456', 'ordered', 0, '2025-04-16 17:34:55', '2025-04-16 17:34:55', NULL, NULL),
(8, 8, '429.00', '0.00', '90.09', '519.09', 'Мери', 'Варданян', '12345678', 'mary.vardanian.1@gmail.com', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Ленина', 'Москва', '123456', 'ordered', 0, '2025-04-16 17:36:57', '2025-04-16 17:36:57', NULL, NULL),
(9, 8, '429.00', '0.00', '90.09', '519.09', 'Мери', 'Варданян', '12345678', 'mary.vardanian.1@gmail.com', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Ленина', 'Москва', '123456', 'ordered', 0, '2025-04-16 17:37:02', '2025-04-16 17:37:02', NULL, NULL),
(10, 8, '429.00', '0.00', '90.09', '519.09', 'Мери', 'Варданян', '12345678', 'mary.vardanian.1@gmail.com', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Ленина', 'Москва', '123456', 'delivered', 0, '2025-04-16 17:37:24', '2025-04-25 16:05:04', '2025-04-25', NULL),
(11, 8, '119.00', '0.00', '0.00', '119.00', 'Мери', 'Варданян', '12345678', 'mary.vardanian.1@gmail.com', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Ленина', 'Москва', '123456', 'canceled', 0, '2025-05-06 14:58:47', '2025-05-06 14:59:39', NULL, '2025-05-06');

-- --------------------------------------------------------

--
-- Структура таблицы `order_items`
--

CREATE TABLE `order_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED NOT NULL,
  `price` decimal(8,2) NOT NULL,
  `quantity` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `rstatus` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `order_items`
--

INSERT INTO `order_items` (`id`, `product_id`, `order_id`, `price`, `quantity`, `created_at`, `updated_at`, `rstatus`) VALUES
(1, 2, 2, '199.00', 1, '2025-04-10 10:57:25', '2025-04-10 10:57:25', 0),
(2, 2, 3, '199.00', 1, '2025-04-10 10:57:51', '2025-04-10 10:57:51', 0),
(3, 2, 4, '199.00', 1, '2025-04-10 10:58:15', '2025-04-10 10:58:15', 0),
(4, 2, 5, '199.00', 2, '2025-04-11 04:28:17', '2025-04-12 20:25:56', 0),
(5, 5, 5, '305.00', 1, '2025-04-11 04:28:17', '2025-04-11 04:28:17', 0),
(6, 2, 6, '199.00', 1, '2025-04-12 16:40:28', '2025-04-12 16:40:28', 0),
(7, 1, 7, '429.00', 2, '2025-04-16 17:34:55', '2025-04-16 17:34:55', 0),
(8, 1, 8, '429.00', 1, '2025-04-16 17:36:57', '2025-04-16 17:36:57', 0),
(9, 1, 9, '429.00', 1, '2025-04-16 17:37:02', '2025-04-16 17:37:02', 0),
(10, 1, 10, '429.00', 1, '2025-04-16 17:37:24', '2025-05-06 15:00:07', 1),
(11, 3, 11, '119.00', 1, '2025-05-06 14:58:47', '2025-05-06 14:58:47', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `password_resets`
--

INSERT INTO `password_resets` (`email`, `token`, `created_at`) VALUES
('meri.vardanyan.1982@mail.ru', '$2y$10$FKa2NMQykLPWzqAYnNDny.dph301M4yjs4S/vR1HwFgy9.crhwL7O', '2025-04-15 06:15:52');

-- --------------------------------------------------------

--
-- Структура таблицы `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `regular_price` decimal(8,2) NOT NULL,
  `sale_price` decimal(8,2) DEFAULT NULL,
  `SKU` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `stock_status` enum('instock','outofstock') COLLATE utf8mb4_unicode_ci NOT NULL,
  `featured` tinyint(1) NOT NULL DEFAULT '0',
  `quantity` int(10) UNSIGNED NOT NULL DEFAULT '10',
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `composition` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `storage_conditions` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `expiration_date` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `squirrels` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `fats` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `carbohydrates` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `calories` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `subcategory_id` bigint(20) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `slug`, `description`, `regular_price`, `sale_price`, `SKU`, `stock_status`, `featured`, `quantity`, `image`, `composition`, `storage_conditions`, `expiration_date`, `squirrels`, `fats`, `carbohydrates`, `calories`, `category_id`, `created_at`, `updated_at`, `subcategory_id`) VALUES
(1, 'Масло сливочное Традиционное 82,5%', 'maslo-slivocnoe-tradicionnoe-825', 'Состав: Пастеризованные сливки Пищевая ценность: белки — 0,5%, жиры — 82,5%, углеводы — 0,8% Срок годности: 35 суток Готовый к употреблению продукт Сливочное масло-ценный пищевой продукт, без которого не обходится ни одна российская семья. Оно нормализует пищеварение, дарит много энергии, легко усваивается и незаменимо для укрепления иммунитета. В его составе много витаминов, минералов и незаменимых жирных кислот. Традиционное сливочном масле «Углече Поле» обладает нежным вкусом и плотной консистенцией. В его составе нет растительных жиров. А для получения продукта используется метод сбивая сливок 30-35 % жирности. И также, содержание соли в масле (0,8-1,2%) повышает стойкость хранения..', '429.00', '400.00', 'PRODUCT-TRADITIONAL-BUTTER-82', 'instock', 0, 15, 'img/products/4.jpg', 'пастеризованные органические сливки', 'хранить при t(3+-2) и относительной влажности воздуха не более 90%', '35 суток', '0,6', '82,5', '0,8', '748', 1, '2024-11-01 09:41:07', '2025-05-04 19:23:55', 3),
(2, 'Молоко цельное 1л мдж 3,5% -5,2%', 'whole-milk-1l-35', 'Молоко «Фермер» обладают превосходным вкусом и максимальным набором питательных микроэлементов. Новейшие технологические разработки, совершенное оборудование, а главное – высочайшее качество исходного сырья позволяют нам проводить самую низкотемпературную пастеризацию в промежутке температурных значений от 74°С до 76°С. Процесс пастеризации завершается охлаждением молока до температуры безвредного хранения +2°С.\n            На наших фермах содержатся ярославская и джерсейская молочные породы коров. Первая славится молоком с высоким содержанием белка и жиров, вторая – особенно нежным молоком с чуть сладковатым привкусом. Корма, которыми питаются наши коровы, выращены органическим способом на подготовленных землях вдали от промышленных производств.\n            Согласно правилам органического сельского хозяйства, на наших фермах практикуется беспривязное содержание животных.\n            РЕЦЕПТ Крубничный коктель Ингредиенты: 1 л отборного молока Углече Поле 500 г свежей или замороженной клубники Сироп топинамбура/мед Приготовление: 1.Взбейте все ингредиенты в блендере, 2. Разлейте в стаканы и украсьте на ваш вкус.', '199.00', '159.20', 'WHOLE-MILK-1L-35', 'instock', 0, 18, 'img/products/5.jpg', 'цельное пастеризованное коровье молоко', 'хранить при температуре 8 С до 6 часов, а при 4 С до суток.', '10 суток', '3,0-3,4', '3,6-5,2', '4.7', '63,2-79,2', 1, '2024-11-01 09:41:07', '2025-05-04 19:24:12', 2),
(3, 'Молоко цельное 500 мл мдж 3,5%-5,2%', 'whole-milk-500ml-35', 'Молоко «Фермер» обладают превосходным вкусом и максимальным набором питательных микроэлементов. Новейшие технологические разработки, совершенное оборудование, а главное – высочайшее качество исходного сырья позволяют нам проводить самую низкотемпературную пастеризацию в промежутке температурных значений от 74°С до 76°С. Процесс пастеризации завершается охлаждением молока до температуры безвредного хранения +2°С. На наших фермах содержатся ярославская и джерсейская молочные породы коров. Первая славится молоком с высоким содержанием белка и жиров, вторая – особенно нежным молоком с чуть сладковатым привкусом. Корма, которыми питаются наши коровы, выращены органическим способом на подготовленных землях вдали от промышленных производств. Согласно правилам органического сельского хозяйства, на наших фермах практикуется беспривязное содержание животных. Продукция \"Углече Поле\" произведена в соотвествии с с российским ГОСТ 33980-2016 «Продукция органического производства. Правила производства, переработки, маркировки и реализации» Состав: Цельное пастеризованное коровье молоко Пищевая ценность: жиры: 3,6-5,2 г белки: 3,0-3,4 г углеводы: 4,7 г. Энергетическая ценность на 100 г продукта: от 63,2 ккал (264,6 кДж) до 79,2 ккал (331,6 кДж). Срок хранения: 10 суток Готовый к употреблению продукт', '119.00', NULL, 'WHOLE-MILK-500ML-35', 'instock', 0, 28, 'img/products/6.jpeg', 'цельное пастеризованное коровье молоко', 'от 0 до + 6 С', '10 суток', '3,0-3,4', '3,6-5,2', '4.7', '63,2-79,2', 1, '2024-11-01 09:41:07', '2024-11-01 09:41:07', 2),
(4, 'Яйцо цесариное, 6 шт', 'guinea-fowl-egg6', 'Цесариные яйца имеют грушевидную форму, они короче и шире куриных, а вес достигает 40—43 грамма.', '150.50', NULL, 'GUINEA-FOWL-EGG6', 'instock', 0, 8, 'img/products/1.jpg', 'Яйцо цесариное', 'от 0°C до +15°C', 'до 25 суток', '16,7', '0,6', '0,6', '155', 2, '2024-11-01 09:41:07', '2024-11-01 09:41:07', NULL),
(5, 'Яйцо куриное розовое, 10 шт', 'pink-chicken-egg10', 'Домашние куриные яйца имеют яркий, насыщенный вкус. Уникальный продукт, в котором сбалансированы все питательные вещества.', '305.00', NULL, 'PINK-CHICKEN-EGG10', 'instock', 0, 9, 'img/products/2.jpeg', 'Яйцо куриное розовое', 'при температуре от 0°C до +20°C — 25 суток', '25 суток', '12,7', '11,5', '0,7', '143', 2, '2024-11-01 09:41:07', '2024-11-01 09:41:07', NULL),
(6, 'Яйцо куриное белое С1, 10 шт', 'white-chicken-eggC110', 'Домашние куриные яйца имеют яркий, насыщенный вкус. Уникальный продукт, в котором сбалансированы все питательные вещества. ', '305.00', NULL, 'WHITE-CHICKEN-EGGC110', 'instock', 0, 5, 'img/products/3.jpg', 'Яйцо куриное белое С1', 'при температуре от 0°C до +20°C — 25 суток', '25 суток', '12,7', '11,5', '0,7', '143', 2, '2024-11-01 09:41:07', '2024-11-01 09:41:07', NULL),
(7, 'Вырезка говяжья (Ангус) охлажденная', 'beef-tenderloin-angus', 'П/ф мясной из говядины (порода Абердин-Ангусская) Высококачественной крупнокуск. бескостн. категории А Состав продукта: пояснично-подвздошная мышца. Пищевая ценность (содержание в 100 г): белок 20 г,жир 4 г. Энергетическая ценность 116 ккал, 488 кДж Условия хранения: Т от 0 до +4°С и отн. влажн. возд. 85%. Изготовлено по СТО 82708450-005-2019. Упаковано в ВАКУУМ. Срок годности – 10 суток. Рекомендации по приготовлению: перед употреблением подвергают термической обработке, по усмотрению потребителя с добавлением поваренной соли и специй. После ВСКРЫТИЯ хранить, при температуре от 0 до +4°С и отн. влажности воздуха 85% НЕ БОЛЕЕ 12 часов.', '5000.00', NULL, 'BEEF-TENDERLOIN-ANGUS', 'instock', 0, 12, 'img/products/11.jpeg', 'Пояснично-подвздошная мышца', 'от 0 до +4ºС', '10 суток', '20', '4', '0', '116', 3, '2024-11-01 09:41:07', '2025-05-04 19:37:04', 4),
(8, 'Стейк Филе миньон(Ангус) охлажденный', 'filet-mignon-steak-angus', 'Стейк Блэк Ангус - самое элитное мясо в мире. Что же такое Филе Миньон? Это тонкий край вырезки, которая находится глубоко внутри туши и меньше всего испытывает какие-либо нагрузки при жизни животного. Мясо Филе Миньон практически лишено жировых прослоек. Это просто очень нежный отруб. В туше животного всего 500 грамм такой вырезки. Обычно стейк быстро обжаривают на высокой температуре, запечатывая все соки внутри. Так мясо получается сочным. Самая подходящая степень прожарки medium rare, что соответствует 52-53°С внутренней температуры. При этом стейк Филе Миньон из говядины нарезают довольно толсто, примерно по 7 см в толщину, и обжаривают, а подают с соусом или вином.', '5000.00', NULL, 'FILET-MIGNON-STEAK-ANGUS', 'instock', 0, 13, 'img/products/12.jpeg', 'Стейк Блэк Ангус', 'от 0 до +4ºС', '10 суток', '20', '4', '0', '116', 3, '2024-11-01 09:41:07', '2025-05-04 19:37:29', 4),
(9, 'Курочка суповая охлажденная', 'soup-chicken', 'Прекрасная основа для наваристого бульона и ингредиент для традиционных салатов, и начинка для пельменей и пирогов.', '790.00', NULL, 'SOUP-CHICKEN', 'instock', 0, 10, 'img/products/10.jpg', 'Курочка', 'от 0 до +4ºС', '6 суток', '18,2', '18,4', '0,1', '238', 3, '2024-11-01 09:41:07', '2025-05-04 19:30:38', 5),
(10, 'Нельма стейк свежемороженый', 'nelma-steak', 'Дикая рыба нельма — символ ихтиофауны Сибири. Белое жирное мясо и отменный вкус – попробуйте и будете потрясены им. Если Вы хотите попробовать северную белую рыбу, то рекомендуем купить свежемороженые стейки нельмы.', '5000.00', NULL, 'NELMA-STEAK', 'instock', 0, 10, 'img/products/7.jpg', 'Нельма. Регион вылова: река Лена', 'от 0 до +4ºС', '365 суток', '17,9', '9', '0', '160', 4, '2024-11-01 09:41:07', '2025-05-04 19:37:56', NULL),
(11, 'Лосось атл (семга) стейк', 'salmon-salmon-steak', 'Атлантический лосось (семгу) знают и любят многие за его изысканный вкус, а всесторонняя польза этой рыбы давно научно доказана! Стейки лосося (семги) очень удобны для приготовления. Вам не нужно тратить время на разделку рыбы. Готовить их можно сразу после разморозки, предварительно промыв и высушив бумажными полотенцами. Стейки можно быстро замариновать на 15-20 минут, используя сок лимона, растительное или оливковое масло, ароматные травы (тимьян, розмарин, кинза), соль и перец. Рекомендуем к стейкам подавать цитрусовый или сливочный соус. Время приготовления стейков толщиной 2,5 см составляет от 5 (прожарка «медиум») до 10 минут. ', '2990.00', NULL, 'SALMON-SALMON-STEAK', 'instock', 0, 10, 'img/products/8.jpg', 'Стейк лосося', '-18 °С', '365 суток', '21,6', '6', '0', '798', 4, '2024-11-01 09:41:07', '2024-11-01 09:41:07', NULL),
(12, 'Стерлядь потрошеная', 'gutted-sterlet', 'Стерлядь коптят, запекают в духовке, готовят из нее уху и заливное. У нее белое, плотное, очень вкусное мясо. Это традиционная для русской кухни рыба, поэтому у нас любят и умеют готовить ее любыми способами. Но все же самый популярный способ приготовления стерляди - запекание в духовке. От других осетровых она отличается небольшим размером, поэтому ее удобно готовить целиком. Яркий вкус позволяет не экспериментировать и готовить максимально просто: смазать маслом и запечь. Можно усложнить рецепт и начинить рыбу травами, кореньями и лаймом, запечь в соли или в белом вине.', '3900.00', NULL, 'GUTTED-STERLET', 'instock', 0, 3, 'img/products/9.jpg', 'Стерлядь. Район вылова: 422 (Рыбинское)', 'от -2°С до 0°С', '12 суток', '19,2', '0,7', '0', '80', 4, '2024-11-01 09:41:07', '2024-11-01 09:41:07', NULL),
(13, 'Бананы', 'bananas', 'Традиционно бананы едят в свежем виде – как идеальный перекус, полдник или добавка к творогу, йогурту или мюсли. Часто банан используют для холодных закусок – десертных бутербродов (калоризатор). Банан отлично подходит для приготовления тортов и пирожных, желе и фруктовых салатов. Также бананы жарят, сушат, вялят, запекают, добавляют в тесто для хлеба и маффинов, используют как сырьё для приготовления мармеладов, муки и сиропов.\n            Употребление бананов оказывает благотворное действие на работу сердечной мышцы, снижает уровень «плохого» холестерина, улучшает работу желудочно-кишечного тракта. Бананы поднимают настроение и способствуют профилактики возникновения стресса.', '250.00', NULL, 'BANANAS', 'instock', 0, 20, 'img/products/13.jpeg', 'В составе банана содержатся: бета-каротин, пектин, витамины В1, В2, В6, С, РР, а также калий, кальций, магний, железо, фтор, фосфор и натрий, фруктоза и клетчатка.', 'при температуре от 6 до +15 °С', '14 суток', '1,5', '0,2', '21,8', '95', 5, '2024-11-01 09:41:07', '2025-05-04 19:35:36', 6),
(14, 'Киви', 'kiwi', 'Полезный и вкусный киви с зеленой мякотью относится к растениям из рода Актинидия. Ботаники причисляют его к ягодам, но потребители называют фруктом.  Киви перетирают с сахаром, сушат, готовят сладкие блюда, салаты, делают маринады. Ягоды хорошо сохраняют свои свойства, долго не портятся и приятны на вкус. Они полезны, одна штука содержит норму аскорбиновой кислоты в сутки. В киви присутствуют и другие витамины, микро- и макроэлементы, флавоноиды. Рекомендуют употреблять для профилактики простудных заболеваний.', '550.00', NULL, 'KIWI', 'instock', 0, 25, 'img/products/14.jpeg', 'В киви содержатся: витамины А, В1, В2, В6, В9, РР, а также минеральные вещества, необходимые организму человека, такие, как: калий, кальций, магний, цинк, марганец, хлор и сера, фтор, фосфор и натрий.', 'при +2…+8°С и влажности 80-85%', '10 суток', '1', '0,6', '10,3', '48', 5, '2024-11-01 09:41:07', '2025-05-04 19:35:51', 6),
(15, 'Баклажаны', 'eggplants', 'Баклажан имеет плотную, упругую мякоть кремового или светло-жёлтого цвета, семена маленькие, плоские, каплевидные или продолговатые. Обычно семена не вычищают, баклажан полностью используют в пищу. Баклажаны можно жарить, готовить на пару, тушить или запекать в духовке. Богатый полезными свойствами продукт можно использовать в виде гарнира, а также готовить как самостоятельное блюдо.', '450.00', '360.00', 'EGGPLANTS', 'instock', 0, 20, 'img/products/15.jpeg', 'Химический состав баклажана характеризуется повышенным содержанием углеводов, белков, клетчатки, витаминов (A, B9, C, K) и минеральных веществ (натрий, калий, кальций, магний).', 'при температуре от 8 до +10 °С и относительной влажности воздуха 70%-85%', '28 суток', '1,2', '0,1', '4,5', '24', 5, '2024-11-01 09:41:07', '2025-05-04 19:36:05', 7),
(27, 'Молоко пастеризованное 3.2%', 'moloko-pasterizovannoe-32', 'Молоко «Углече Поле» обладают превосходным вкусом и максимальным набором питательных микроэлементов. Новейшие технологические разработки, совершенное оборудование, а главное – высочайшее качество исходного сырья позволяют нам проводить самую низкотемпературную пастеризацию в промежутке температурных значений от 74°С до 76°С.\nПроцесс пастеризации завершается охлаждением молока до температуры безвредного хранения +2°С.\nНа наших фермах содержатся ярославская и джерсейская молочные породы коров. Первая славится молоком с высоким содержанием белка и жиров, вторая – особенно нежным молоком с чуть сладковатым привкусом.\nКорма, которыми питаются наши коровы, выращены органическим способом на подготовленных землях вдали от промышленных производств. Согласно правилам органического сельского хозяйства, на наших фермах практикуется беспривязное содержание животных.', '189.00', NULL, 'МОЛ-ПАС-3.2-МОЛ', 'instock', 0, 94, 'img/products/1746400212.jpg', NULL, NULL, '10 суток', '3', '3', '4,7', '60', 1, '2025-05-04 20:10:12', '2025-05-04 20:10:12', 2),
(28, 'Молоко пастеризованное 2,5%', 'moloko-pasterizovannoe-25', 'Молоко «Углече Поле» обладают превосходным вкусом и максимальным набором питательных микроэлементов. Новейшие технологические разработки, совершенное оборудование, а главное – высочайшее качество исходного сырья позволяют нам проводить самую низкотемпературную пастеризацию в промежутке температурных значений от 74°С до 76°С. Процесс пастеризации завершается охлаждением молока до температуры безвредного хранения +2°С. На наших фермах содержатся ярославская и джерсейская молочные породы коров. Первая славится молоком с высоким содержанием белка и жиров, вторая – особенно нежным молоком с чуть сладковатым привкусом. Корма, которыми питаются наши коровы, выращены органическим способом на подготовленных землях вдали от промышленных производств. Согласно правилам органического сельского хозяйства, на наших фермах практикуется беспривязное содержание животных. Продукция \"Углече Поле\" произведена в соотвествии с с российским ГОСТ 33980-2016 «Продукция органического производства. Правила производства, переработки, маркировки и реализации» Состав: Пастеризованное коровье молоко Пищевая ценность: жиры: 2,5 г белки: 2,5 г углеводы: 4,1 г. Энергетическая ценность на 100 г продукта: от 53 ккал (222 кДж) Срок хранения: 10 суток', '179.00', NULL, 'Молочные продукты	МОЛ-ПАС-2,5-МОЛ', 'instock', 0, 82, 'img/products/1746401376.jpg', NULL, NULL, '10 суток', '2,5', '2,5', '4,1', '53', 1, '2025-05-04 20:29:36', '2025-05-04 20:29:36', 2),
(29, 'Молоко топленое мдж 4,0% 500 гр', 'moloko-toplenoe-mdz-40-500-gr', 'Топленое молоко-это едва уловимый карамельно-ореховый привкус, приятный кремовый цвет и неоценимая польза для здоровья. Тот самый случай, когда безупречный вкус был создан без пищевых добавок, стабилизаторов и консервантов! Новейшие технологические разработки, совершенное оборудование, а главное – высочайшее качество исходного сырья позволяют нам проводить самую низкотемпературную пастеризацию в промежутке температурных значений от 74°С до 76°С. Процесс пастеризации завершается охлаждением молока до температуры безвредного хранения +2°С. На наших фермах содержатся ярославская и джерсейская молочные породы коров. Первая славится молоком с высоким содержанием белка и жиров, вторая – особенно нежным молоком с чуть сладковатым привкусом. Корма, которыми питаются наши коровы, выращены органическим способом на подготовленных землях вдали от промышленных производств. Согласно правилам органического сельского хозяйства, на наших фермах практикуется беспривязное содержание животных. Продукция \"Углече Поле\" произведена в соотвествии с с российским ГОСТ 33980-2016 «Продукция органического производства. Правила производства, переработки, маркировки и реализации» Состав: цельное пастеризованное органическое молоко Пищевая ценность в 100 г продукта: жиры- 3,6-4,2 г, белки: 3 г, углеводы:4,7 г Энергетическая ценность: 63,2-68,6 кКал (244,4-287,2 кДж) Срок годности -10 суток', '119.00', '52.00', 'Молочные продукты	МОЛ-ТОП-4,0-МОЛ', 'instock', 0, 63, 'img/products/1746402056.jpg', NULL, 'Хранится при температуре от 0 до +6 °С и относительной влажности воздуха 70%-85% включительно.', '10 суток', '3', '3,6-4,2', '4,7', '63,2-68,6', 1, '2025-05-04 20:40:56', '2025-05-04 20:40:56', 2),
(30, 'Стейк Рибай (Ангус) охл скин', 'steik-ribai-angus-oxl-skin', 'Стейк Рибай – классический стейк, по внешнему виду которого судят о качестве мяса в целом. Стейк выделяется из реберной части быка, отличается мягкостью, сочностью, благодаря наличию жировой прослойки. Стейк Рибай не требует маринада перед приготовлением. Готовить его лучше на хорошо раскаленной сковороде или гриле. В случае приготовления на сковороде добавьте перец и соль в конце прожаривания. Если вы готовить на гриле, добавьте перец в начале. Для мясного поголовья «Углече Поле» выбрана Абердин-Ангусская порода коров – признанная лучшей по качеству и вкусу мяса и стейков. При пастбищном содержании (то есть наши животные свободно пасутся на поле) мясо получается более диетическим и таким, каким оно и должно быть - в нем меньше жира, оно сочное, мягкое и обладает насыщенным вкусом. Мясо и мясные продукты «Углече Поле»- это традиции качества и безопасности, поэтому вся продукция упакована в цехе в стерильных условиях, что гарантирует чистоту и свежесть мяса на вашей кухне.', '2716.00', '2172.00', 'СТЕ-РИБ-ОХЛ-СКИ', 'instock', 0, 48, 'img/products/1746402601.jpg', NULL, NULL, '10 суток', NULL, NULL, NULL, NULL, 3, '2025-05-04 20:50:01', '2025-05-04 20:50:01', 4),
(31, 'Курица фермерская для жарки охл', 'kurica-fermerskaia-dlia-zarki-oxl', 'Курица бройлер идеальный вариант для жарки и запекания. Средний вес составляет 1,8-2 кг и одной курочки хватит на ужин для всей семьи. При приготовлении мясо становится мягким и нежным, а корочка хрустящей и сочной. Пищевая ценность на 100 грамм продукта: белки — 20,3 г; жиры — 6,7 г; углеводы — 1,1 г. Энергетическая ценность (калорийность) — 288/1205 ккал/кДж', '790.00', '695.00', 'КУР-ФЕР-ОХЛ', 'instock', 0, 86, 'img/products/1746402865.jpg', NULL, 'от 0 до +4ºС', '6 суток', '20,3', '6,7', '1,1', '288', 3, '2025-05-04 20:54:25', '2025-05-04 20:54:25', 5),
(32, 'Цыпленок охл', 'cyplenok-oxl', 'Цыпленок — корнишон это миниатюрная версия обычного цыпленка. Он идеально подойдет на ужин для двух человек. Сочное и нежное мясо лучше всего подавать с овощами и зеленью.', '890.00', NULL, 'ЦЫП-КОР-ОХЛ', 'instock', 0, 65, 'img/products/1746403101.jpg', NULL, 'от 0 до +4ºС', '6 суток', '25,2', '19,3', '2,0', '140', 3, '2025-05-04 20:58:21', '2025-05-04 20:58:21', 5),
(33, 'Свежемороженые стейки осетра', 'svezemorozenye-steiki-osetra', 'Кусочки рыб осетровых видов – это отборное мясо с идеальной структурой и вкусом, который вы можете дополнить сами, создавая свои кулинарные изыски дома или на природе. Обжаренные стейки или осетровый шашлык – блюда, которые вряд ли смогут вам надоесть.', '3250.00', NULL, 'СТЕ-СВЕ-ОСЕ', 'instock', 0, 77, 'img/products/1746403392.jpg', NULL, '-18 °С', NULL, '16,4', '10,9', NULL, '163,7', 4, '2025-05-04 21:03:12', '2025-05-04 21:03:12', NULL),
(34, 'Хурма', 'xurma', 'Пища богов – так переводится название \"Хурма\" с латинского языка. Сочный и спелый фрукт станет идеальным перекусом в течении дня, а также обогатит Ваш организм множеством полезных витаминов. Часто хурму включают в рацион при похудении.', '990.00', '940.00', 'ХУР-1КГ', 'instock', 0, 47, 'img/products/1746403742.jpg', NULL, NULL, NULL, '0,6', '0,2', '18', '70', 5, '2025-05-04 21:09:02', '2025-05-04 21:09:02', 6),
(35, 'Мандарины', 'mandariny', 'В своём составе мандарины содержат пектины, лимонную кислоту, витамины А, В1, В2, В6, С, D, К, РР, а также необходимые организму минеральные вещества калий, кальций, магний, железо, фосфор и натрий, сахара и пищевые волокна. Мандарины не накапливают нитраты, поэтому подходят для диетического и лечебного питания. Плоды являются мощной «витаминной бомбой», способной восполнить утраченные за осенне-зимний период витамины, они могут выступать в качестве противовоспалительного и жаропонижающего средства, антимикробным действием обладают фитонциды, которыми богаты мандарины.\nКак правило мандарин употребляется в пищу в свежем виде. Кроме того, эти фрукты широко используются для изготовления соков, компотов, варенья, десертов, а также всевозможные соусы, салаты, рыбные и мучные блюда, кондитерские и хлебобулочные изделия. При этом в кулинарии применяется не только мякоть мандарина, но и кожура, содержащая большое количество эфирных масел. В частности цедра из этих плодов часто используется в производстве вин, ликеров и бренди.', '550.00', NULL, 'МАН-1КГ', 'instock', 0, 61, 'img/products/1746403933.jpg', NULL, 'Хранится при температуре от 0 до +6 °С и относительной влажности воздуха 70%-85% включительно.', '28 суток', '0,8', '0,2', '7,5', '33', 5, '2025-05-04 21:12:13', '2025-05-04 21:12:13', 6);

-- --------------------------------------------------------

--
-- Структура таблицы `profiles`
--

CREATE TABLE `profiles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `line1` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `line2` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `province` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `country` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `zipcode` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `profiles`
--

INSERT INTO `profiles` (`id`, `user_id`, `image`, `mobile`, `line1`, `line2`, `city`, `province`, `country`, `zipcode`, `created_at`, `updated_at`) VALUES
(1, 8, '1746554466.jpg', '+79688566074', 'Кирова', 'д. 1, кв. 2', 'Москва', 'Левобережный', 'Центральный', '1212121', '2025-04-25 12:45:28', '2025-05-06 15:01:06'),
(2, 6, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-03 14:26:19', '2025-05-03 14:26:19');

-- --------------------------------------------------------

--
-- Структура таблицы `reviews`
--

CREATE TABLE `reviews` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `rating` int(11) NOT NULL,
  `comment` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `order_item_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `reviews`
--

INSERT INTO `reviews` (`id`, `rating`, `comment`, `order_item_id`, `created_at`, `updated_at`) VALUES
(1, 4, 'отлично', 4, '2025-04-12 20:25:56', '2025-04-12 20:25:56'),
(3, 5, 'jfhejbfdgv', 10, '2025-05-06 15:00:07', '2025-05-06 15:00:07');

-- --------------------------------------------------------

--
-- Структура таблицы `sales`
--

CREATE TABLE `sales` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sale_date` datetime NOT NULL,
  `status` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `sales`
--

INSERT INTO `sales` (`id`, `sale_date`, `status`, `created_at`, `updated_at`) VALUES
(1, '2025-07-01 10:13:53', 1, NULL, '2025-05-04 08:13:58');

-- --------------------------------------------------------

--
-- Структура таблицы `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_agent` text COLLATE utf8mb4_unicode_ci,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('g3Tj6ByNviydUvfQzj2Ca7vbSUdEg599PO4GfUtw', 2, '::1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/132.0.0.0 YaBrowser/25.2.0.0 Safari/537.36', 'YTo3OntzOjY6Il90b2tlbiI7czo0MDoiU2xlRkhBN3pldGJSaGo0N0FxcFBwR09IWUpDOU5tSzE1cEc5RFZzMCI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6NDE6Imh0dHA6Ly9sb2NhbGhvc3Q6ODg4OC9teXNpdGVkaXBsb20vcHVibGljIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo0OiJjYXJ0IjthOjM6e3M6ODoid2lzaGxpc3QiO086Mjk6IklsbHVtaW5hdGVcU3VwcG9ydFxDb2xsZWN0aW9uIjoyOntzOjg6IgAqAGl0ZW1zIjthOjE6e3M6MzI6IjAyN2M5MTM0MWZkNWNmNGQyNTc5YjQ5YzRiNmE5MGRhIjtPOjMyOiJHbG91ZGVtYW5zXFNob3BwaW5nY2FydFxDYXJ0SXRlbSI6OTp7czo1OiJyb3dJZCI7czozMjoiMDI3YzkxMzQxZmQ1Y2Y0ZDI1NzliNDljNGI2YTkwZGEiO3M6MjoiaWQiO2k6MTtzOjM6InF0eSI7aToxO3M6NDoibmFtZSI7czo2MDoi0JzQsNGB0LvQviDRgdC70LjQstC+0YfQvdC+0LUg0KLRgNCw0LTQuNGG0LjQvtC90L3QvtC1IDgyLDUlIjtzOjU6InByaWNlIjtkOjQyOTtzOjc6Im9wdGlvbnMiO086Mzk6Ikdsb3VkZW1hbnNcU2hvcHBpbmdjYXJ0XENhcnRJdGVtT3B0aW9ucyI6Mjp7czo4OiIAKgBpdGVtcyI7YTowOnt9czoyODoiACoAZXNjYXBlV2hlbkNhc3RpbmdUb1N0cmluZyI7YjowO31zOjQ5OiIAR2xvdWRlbWFuc1xTaG9wcGluZ2NhcnRcQ2FydEl0ZW0AYXNzb2NpYXRlZE1vZGVsIjtzOjE4OiJBcHBcTW9kZWxzXFByb2R1Y3QiO3M6NDE6IgBHbG91ZGVtYW5zXFNob3BwaW5nY2FydFxDYXJ0SXRlbQB0YXhSYXRlIjtpOjA7czo0MToiAEdsb3VkZW1hbnNcU2hvcHBpbmdjYXJ0XENhcnRJdGVtAGlzU2F2ZWQiO2I6MDt9fXM6Mjg6IgAqAGVzY2FwZVdoZW5DYXN0aW5nVG9TdHJpbmciO2I6MDt9czo0OiJjYXJ0IjtPOjI5OiJJbGx1bWluYXRlXFN1cHBvcnRcQ29sbGVjdGlvbiI6Mjp7czo4OiIAKgBpdGVtcyI7YToxOntzOjMyOiIzNzBkMDg1ODUzNjBmNWM1NjhiMThkMWYyZTRjYTFkZiI7TzozMjoiR2xvdWRlbWFuc1xTaG9wcGluZ2NhcnRcQ2FydEl0ZW0iOjk6e3M6NToicm93SWQiO3M6MzI6IjM3MGQwODU4NTM2MGY1YzU2OGIxOGQxZjJlNGNhMWRmIjtzOjI6ImlkIjtpOjI7czozOiJxdHkiO2k6MTtzOjQ6Im5hbWUiO3M6NDk6ItCc0L7Qu9C+0LrQviDRhtC10LvRjNC90L7QtSAx0Lsg0LzQtNC2IDMsNSUgLTUsMiUiO3M6NToicHJpY2UiO2Q6MTU5LjI7czo3OiJvcHRpb25zIjtPOjM5OiJHbG91ZGVtYW5zXFNob3BwaW5nY2FydFxDYXJ0SXRlbU9wdGlvbnMiOjI6e3M6ODoiACoAaXRlbXMiO2E6MDp7fXM6Mjg6IgAqAGVzY2FwZVdoZW5DYXN0aW5nVG9TdHJpbmciO2I6MDt9czo0OToiAEdsb3VkZW1hbnNcU2hvcHBpbmdjYXJ0XENhcnRJdGVtAGFzc29jaWF0ZWRNb2RlbCI7czoxODoiQXBwXE1vZGVsc1xQcm9kdWN0IjtzOjQxOiIAR2xvdWRlbWFuc1xTaG9wcGluZ2NhcnRcQ2FydEl0ZW0AdGF4UmF0ZSI7aTowO3M6NDE6IgBHbG91ZGVtYW5zXFNob3BwaW5nY2FydFxDYXJ0SXRlbQBpc1NhdmVkIjtiOjA7fX1zOjI4OiIAKgBlc2NhcGVXaGVuQ2FzdGluZ1RvU3RyaW5nIjtiOjA7fXM6MTI6InNhdmVGb3JMYXRlciI7TzoyOToiSWxsdW1pbmF0ZVxTdXBwb3J0XENvbGxlY3Rpb24iOjI6e3M6ODoiACoAaXRlbXMiO2E6MDp7fXM6Mjg6IgAqAGVzY2FwZVdoZW5DYXN0aW5nVG9TdHJpbmciO2I6MDt9fXM6ODoiY2hlY2tvdXQiO2E6NDp7czo4OiJkaXNjb3VudCI7aTowO3M6ODoic3VidG90YWwiO3M6NjoiMTU5LjIwIjtzOjM6InRheCI7czo0OiIwLjAwIjtzOjU6InRvdGFsIjtzOjY6IjE1OS4yMCI7fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjI7czo1OiJ1dHlwZSI7czozOiJBRE0iO30=', 1747234550),
('gBeIFBJvvmOUHDriGltfYIezI8XJU3J6uLTQBaxq', 2, '::1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/132.0.0.0 YaBrowser/25.2.0.0 Safari/537.36', 'YTo3OntzOjY6Il90b2tlbiI7czo0MDoiWEJDTzJhWFU0V2dDNVlWSWhjbm1NVmlxcXpUV3Q3MVZaRXFhanN6eCI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6NDE6Imh0dHA6Ly9sb2NhbGhvc3Q6ODg4OC9teXNpdGVkaXBsb20vcHVibGljIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6MjtzOjU6InV0eXBlIjtzOjM6IkFETSI7czo0OiJjYXJ0IjthOjE6e3M6NDoiY2FydCI7TzoyOToiSWxsdW1pbmF0ZVxTdXBwb3J0XENvbGxlY3Rpb24iOjI6e3M6ODoiACoAaXRlbXMiO2E6MTp7czozMjoiMDI3YzkxMzQxZmQ1Y2Y0ZDI1NzliNDljNGI2YTkwZGEiO086MzI6Ikdsb3VkZW1hbnNcU2hvcHBpbmdjYXJ0XENhcnRJdGVtIjo5OntzOjU6InJvd0lkIjtzOjMyOiIwMjdjOTEzNDFmZDVjZjRkMjU3OWI0OWM0YjZhOTBkYSI7czoyOiJpZCI7aToxO3M6MzoicXR5IjtpOjE7czo0OiJuYW1lIjtzOjYwOiLQnNCw0YHQu9C+INGB0LvQuNCy0L7Rh9C90L7QtSDQotGA0LDQtNC40YbQuNC+0L3QvdC+0LUgODIsNSUiO3M6NToicHJpY2UiO2Q6NDAwO3M6Nzoib3B0aW9ucyI7TzozOToiR2xvdWRlbWFuc1xTaG9wcGluZ2NhcnRcQ2FydEl0ZW1PcHRpb25zIjoyOntzOjg6IgAqAGl0ZW1zIjthOjA6e31zOjI4OiIAKgBlc2NhcGVXaGVuQ2FzdGluZ1RvU3RyaW5nIjtiOjA7fXM6NDk6IgBHbG91ZGVtYW5zXFNob3BwaW5nY2FydFxDYXJ0SXRlbQBhc3NvY2lhdGVkTW9kZWwiO3M6MTg6IkFwcFxNb2RlbHNcUHJvZHVjdCI7czo0MToiAEdsb3VkZW1hbnNcU2hvcHBpbmdjYXJ0XENhcnRJdGVtAHRheFJhdGUiO2k6MDtzOjQxOiIAR2xvdWRlbWFuc1xTaG9wcGluZ2NhcnRcQ2FydEl0ZW0AaXNTYXZlZCI7YjowO319czoyODoiACoAZXNjYXBlV2hlbkNhc3RpbmdUb1N0cmluZyI7YjowO319czo4OiJjaGVja291dCI7YTo0OntzOjg6ImRpc2NvdW50IjtpOjA7czo4OiJzdWJ0b3RhbCI7czo2OiI0MDAuMDAiO3M6MzoidGF4IjtzOjQ6IjAuMDAiO3M6NToidG90YWwiO3M6NjoiNDAwLjAwIjt9fQ==', 1747418173),
('Q1hOWmSqTHuNUz8jaqJsLbo1Nf5hpyVFgnmqgBRs', NULL, '::1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/132.0.0.0 YaBrowser/25.2.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiQVUySGtZblRVdEFzeFpsUFY2RXU3V1R3OEl3eUNjRWl5d1BtNUhqUyI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6NDE6Imh0dHA6Ly9sb2NhbGhvc3Q6ODg4OC9teXNpdGVkaXBsb20vcHVibGljIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1747341369),
('ujyEGKk3SzFZqIMMgVBGCUG1mx1T7OI8ilDh46pI', NULL, '::1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/132.0.0.0 YaBrowser/25.2.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoibnlkTUJDYUlJTFdmRDF1RGQ4cGtEZGcycnZEY25naURlejFqZ2p3SyI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6NDE6Imh0dHA6Ly9sb2NhbGhvc3Q6ODg4OC9teXNpdGVkaXBsb20vcHVibGljIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1747242023);

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

CREATE TABLE `settings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone2` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `map` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `vk` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ok` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `shippings`
--

CREATE TABLE `shippings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED NOT NULL,
  `firstname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `lastname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `line1` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `line2` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `province` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `zipcode` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `shippings`
--

INSERT INTO `shippings` (`id`, `order_id`, `firstname`, `lastname`, `mobile`, `email`, `line1`, `line2`, `city`, `province`, `country`, `zipcode`, `created_at`, `updated_at`) VALUES
(1, 3, 'Username', 'Usersurname', '123456789', 'user@mail.ru', 'testuls', 'testdoms, testkvs', 'testgorods', 'testrays', 'testregs', '123452', '2025-04-10 10:57:51', '2025-04-10 10:57:51'),
(2, 4, 'Username', 'Usersurname', '123456789', 'user@mail.ru', 'testuls', 'testdoms, testkvs', 'testgorods', 'testrays', 'testregs', '123452', '2025-04-10 10:58:15', '2025-04-10 10:58:15'),
(3, 6, 'Вася', 'Пупкин', '12345678', 'vasya@mail.ru', 'Ленина', 'д. 1, кв. 2', 'Москва', 'Ленина', 'Москва', '123456', '2025-04-12 16:40:28', '2025-04-12 16:40:28');

-- --------------------------------------------------------

--
-- Структура таблицы `shoppingcart`
--

CREATE TABLE `shoppingcart` (
  `identifier` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `instance` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `shoppingcart`
--

INSERT INTO `shoppingcart` (`identifier`, `instance`, `content`, `created_at`, `updated_at`) VALUES
('8', 'wishlist', 'O:29:\"Illuminate\\Support\\Collection\":2:{s:8:\"\0*\0items\";a:2:{s:32:\"efb26e2c6ab6bd4d1323288923522d4e\";O:32:\"Gloudemans\\Shoppingcart\\CartItem\":9:{s:5:\"rowId\";s:32:\"efb26e2c6ab6bd4d1323288923522d4e\";s:2:\"id\";i:4;s:3:\"qty\";i:1;s:4:\"name\";s:35:\"Яйцо цесариное, 6 шт\";s:5:\"price\";d:150.5;s:7:\"options\";O:39:\"Gloudemans\\Shoppingcart\\CartItemOptions\":2:{s:8:\"\0*\0items\";a:0:{}s:28:\"\0*\0escapeWhenCastingToString\";b:0;}s:49:\"\0Gloudemans\\Shoppingcart\\CartItem\0associatedModel\";s:18:\"App\\Models\\Product\";s:41:\"\0Gloudemans\\Shoppingcart\\CartItem\0taxRate\";i:21;s:41:\"\0Gloudemans\\Shoppingcart\\CartItem\0isSaved\";b:0;}s:32:\"370d08585360f5c568b18d1f2e4ca1df\";O:32:\"Gloudemans\\Shoppingcart\\CartItem\":9:{s:5:\"rowId\";s:32:\"370d08585360f5c568b18d1f2e4ca1df\";s:2:\"id\";i:2;s:3:\"qty\";i:1;s:4:\"name\";s:49:\"Молоко цельное 1л мдж 3,5% -5,2%\";s:5:\"price\";d:199;s:7:\"options\";O:39:\"Gloudemans\\Shoppingcart\\CartItemOptions\":2:{s:8:\"\0*\0items\";a:0:{}s:28:\"\0*\0escapeWhenCastingToString\";b:0;}s:49:\"\0Gloudemans\\Shoppingcart\\CartItem\0associatedModel\";s:18:\"App\\Models\\Product\";s:41:\"\0Gloudemans\\Shoppingcart\\CartItem\0taxRate\";i:21;s:41:\"\0Gloudemans\\Shoppingcart\\CartItem\0isSaved\";b:0;}}s:28:\"\0*\0escapeWhenCastingToString\";b:0;}', '2025-04-29 13:21:29', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `subcategories`
--

CREATE TABLE `subcategories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `subcategories`
--

INSERT INTO `subcategories` (`id`, `name`, `slug`, `category_id`, `created_at`, `updated_at`) VALUES
(2, 'Молоко', 'moloko', 1, '2025-04-19 11:55:03', '2025-04-19 11:55:03'),
(3, 'Масло', 'maslo', 1, '2025-04-19 11:55:13', '2025-04-19 11:55:13'),
(4, 'Говядина', 'goviadina', 3, '2025-05-04 19:27:43', '2025-05-04 19:29:20'),
(5, 'Курица', 'kurica', 3, '2025-05-04 19:30:17', '2025-05-04 19:30:17'),
(6, 'Фрукты', 'frukty', 5, '2025-05-04 19:35:00', '2025-05-04 19:35:00'),
(7, 'Овощи', 'ovoshhi', 5, '2025-05-04 19:35:17', '2025-05-04 19:35:17');

-- --------------------------------------------------------

--
-- Структура таблицы `transactions`
--

CREATE TABLE `transactions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED NOT NULL,
  `mode` enum('cod','card','paypal') COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` enum('pending','approved','declined','refunded') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `transactions`
--

INSERT INTO `transactions` (`id`, `user_id`, `order_id`, `mode`, `status`, `created_at`, `updated_at`) VALUES
(1, 5, 4, 'cod', 'pending', '2025-04-10 10:58:15', '2025-04-10 10:58:15'),
(2, 6, 5, 'cod', 'pending', '2025-04-11 04:28:17', '2025-04-11 04:28:17'),
(3, 6, 6, 'cod', 'pending', '2025-04-12 16:40:28', '2025-04-12 16:40:28'),
(4, 8, 7, 'cod', 'pending', '2025-04-16 17:34:55', '2025-04-16 17:34:55'),
(5, 8, 8, 'cod', 'pending', '2025-04-16 17:36:57', '2025-04-16 17:36:57'),
(6, 8, 9, 'cod', 'pending', '2025-04-16 17:37:02', '2025-04-16 17:37:02'),
(7, 8, 10, 'cod', 'pending', '2025-04-16 17:37:24', '2025-04-16 17:37:24'),
(8, 8, 11, 'cod', 'pending', '2025-05-06 14:58:47', '2025-05-06 14:58:47');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `two_factor_secret` text COLLATE utf8mb4_unicode_ci,
  `two_factor_recovery_codes` text COLLATE utf8mb4_unicode_ci,
  `two_factor_confirmed_at` timestamp NULL DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `current_team_id` bigint(20) UNSIGNED DEFAULT NULL,
  `profile_photo_path` varchar(2048) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `utype` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'USR',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `two_factor_secret`, `two_factor_recovery_codes`, `two_factor_confirmed_at`, `remember_token`, `current_team_id`, `profile_photo_path`, `utype`, `created_at`, `updated_at`) VALUES
(1, 'Mary', 'mary@mail', NULL, '$2y$10$A88Xv1hiZc7bxHgRIO7txOyyxjtfqB7bOXl1p6cBzUizNoJIQN3LS', NULL, NULL, NULL, NULL, NULL, NULL, 'USR', '2024-11-11 19:33:23', '2024-11-11 19:33:23'),
(2, 'Admin', 'admin@admin.com', NULL, '$2y$10$i525LXd5Ykm/1S5sz3o5Bu6TNVzKcCJancb4hzH7fpVGrnmmM4ly.', NULL, NULL, NULL, NULL, NULL, NULL, 'ADM', '2025-02-28 12:08:51', '2025-02-28 12:08:51'),
(3, 'user', 'user@mail', NULL, '$2y$10$Mw9HHX1eXSN/nQxEaTuWLupALQpw1KzMcwACw5AZjNm7BEyv8ij6.', NULL, NULL, NULL, NULL, NULL, NULL, 'USR', '2025-03-10 11:28:11', '2025-03-10 11:28:11'),
(4, 'help', 'help@mail.ru', NULL, '$2y$10$iD85yQRypj.84Xwzy.eXNuOWw8KeJnoW8lJxHp6WrofagvXA9Fzwy', NULL, NULL, NULL, NULL, NULL, NULL, 'USR', '2025-03-11 18:21:11', '2025-03-11 18:21:11'),
(5, 'User', 'user@mail.ru', NULL, '$2y$10$5TU77/mDM8W2JL2vMmRibu4awC1ROgNQwE4l7VKsXmm8FXvfUJZkO', NULL, NULL, NULL, NULL, NULL, NULL, 'USR', '2025-04-09 16:19:08', '2025-04-09 16:19:08'),
(6, 'user2', 'user2@mail.ru', NULL, '$2y$10$oDacY9q7/Xel3DcwPEmbh.sYwczoxU.WCYdXb1775QtxDEcoWSgd6', NULL, NULL, NULL, NULL, NULL, NULL, 'USR', '2025-04-11 04:26:36', '2025-04-14 03:46:54'),
(7, 'Mary', 'meri.vardanyan.1982@mail.ru', NULL, '$2y$10$pRKxzec1jgZsp1l6jFylkOYkyPQjvY5b4OT/YuLSdeQTd7u2mtCnK', NULL, NULL, NULL, NULL, NULL, NULL, 'USR', '2025-04-14 20:21:23', '2025-04-14 20:21:23'),
(8, 'Test', 'mary.vardanian.1@gmail.com', NULL, '$2y$10$IphOG7JR3gd11.dpfIvbO.smbVV0KQmnr590mOiyj4COmytCww9x.', NULL, NULL, NULL, 'WVxCU5qxaEqTq5SS5DVshBBVF4fFTwVBYYg1hbh5HLVEFMtz9c5SXyIEiGzS', NULL, NULL, 'USR', '2025-04-15 08:44:57', '2025-04-15 08:47:37');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `categories_name_unique` (`name`),
  ADD UNIQUE KEY `categories_slug_unique` (`slug`);

--
-- Индексы таблицы `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `coupons`
--
ALTER TABLE `coupons`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `coupons_code_unique` (`code`);

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `home_categories`
--
ALTER TABLE `home_categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `orders_user_id_foreign` (`user_id`);

--
-- Индексы таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_items_product_id_foreign` (`product_id`),
  ADD KEY `order_items_order_id_foreign` (`order_id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD PRIMARY KEY (`email`);

--
-- Индексы таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `products_slug_unique` (`slug`),
  ADD KEY `products_category_id_foreign` (`category_id`),
  ADD KEY `products_subcategory_id_foreign` (`subcategory_id`);

--
-- Индексы таблицы `profiles`
--
ALTER TABLE `profiles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `profiles_user_id_foreign` (`user_id`);

--
-- Индексы таблицы `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`id`),
  ADD KEY `reviews_order_item_id_foreign` (`order_item_id`);

--
-- Индексы таблицы `sales`
--
ALTER TABLE `sales`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `shippings`
--
ALTER TABLE `shippings`
  ADD PRIMARY KEY (`id`),
  ADD KEY `shippings_order_id_foreign` (`order_id`);

--
-- Индексы таблицы `shoppingcart`
--
ALTER TABLE `shoppingcart`
  ADD PRIMARY KEY (`identifier`,`instance`);

--
-- Индексы таблицы `subcategories`
--
ALTER TABLE `subcategories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `subcategories_name_unique` (`name`),
  ADD UNIQUE KEY `subcategories_slug_unique` (`slug`),
  ADD KEY `subcategories_category_id_foreign` (`category_id`);

--
-- Индексы таблицы `transactions`
--
ALTER TABLE `transactions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `transactions_user_id_foreign` (`user_id`),
  ADD KEY `transactions_order_id_foreign` (`order_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `coupons`
--
ALTER TABLE `coupons`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `home_categories`
--
ALTER TABLE `home_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT для таблицы `profiles`
--
ALTER TABLE `profiles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `reviews`
--
ALTER TABLE `reviews`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `sales`
--
ALTER TABLE `sales`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `settings`
--
ALTER TABLE `settings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `shippings`
--
ALTER TABLE `shippings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `subcategories`
--
ALTER TABLE `subcategories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `transactions`
--
ALTER TABLE `transactions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_items_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `products_subcategory_id_foreign` FOREIGN KEY (`subcategory_id`) REFERENCES `subcategories` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `profiles`
--
ALTER TABLE `profiles`
  ADD CONSTRAINT `profiles_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `reviews`
--
ALTER TABLE `reviews`
  ADD CONSTRAINT `reviews_order_item_id_foreign` FOREIGN KEY (`order_item_id`) REFERENCES `order_items` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `shippings`
--
ALTER TABLE `shippings`
  ADD CONSTRAINT `shippings_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `subcategories`
--
ALTER TABLE `subcategories`
  ADD CONSTRAINT `subcategories_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `transactions`
--
ALTER TABLE `transactions`
  ADD CONSTRAINT `transactions_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `transactions_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
